# `AA` - Workshop 03

In this tutorial we will continue with our introduction series to key python data science libraries. Today we will focus on `Pandas`.

We will go through the following:

- **Introduction to `Pandas` objects**: Learn what `Pandas` Series, DataFrames and Indices are and what they are used for
- **Data selection in `Pandas`**: Index rows, columns and individual items in a `Pandas` Series and DataFrame
- **Data anaylsis and manipulation in `Pandas`**: Perform advanced hierarchical indexing on your dataset, Run simple descriptives on your dataset, Handle missing data, Carry out aggregation and grouping


## `Pandas`

Pandas is a newer package built on top of `NumPy`, and provides an efficient implementation of a `DataFrame`, the core Pandas object. DataFrames are essentially multidimensional arrays with attached row and column labels, and often with heterogeneous types and/or missing data. As well as offering a convenient storage interface for labeled data, Pandas implements a number of powerful data operations familiar to users of both database frameworks and spreadsheet programs. We will use `Pandas` as the main tool to structure, manipulate and store data throughout this course. As such Pandas constitutes a core data science library that all of you should be very well familiar with.

Let's get started...

In [1]:
import numpy as np
import pandas as pd

### Introduction to `Pandas` objects

At the very basic level, Pandas objects can be thought of as enhanced versions of NumPy structured arrays in which the rows and columns are identified with labels rather than simple integer indices. Pandas provides a host of useful tools, methods, and functionality on top of the basic data structures, but nearly everything that follows will require an understanding of what these structures are. Thus, before we go any further, let's introduce these three fundamental Pandas data structures: the Series, DataFrame, and Index.

#### The `Pandas Series` Object
A Pandas Series is a one-dimensional array of indexed data. It can be created from a list or array as follows:

In [2]:
B = [12,13,14,15,16,17]
B

[12, 13, 14, 15, 16, 17]

In [3]:
F = pd.Series(B)
F

0    12
1    13
2    14
3    15
4    16
5    17
dtype: int64

As we see in the output, the Series wraps both a sequence of values and a sequence of indices, which we can access with the values and index attributes. The values are simply a familiar NumPy array:

In [4]:
F.values

array([12, 13, 14, 15, 16, 17])

The index is an array-like object of type pd.Index, which we'll discuss in more detail later.

In [5]:
F.index

RangeIndex(start=0, stop=6, step=1)

Like with a `NumPy` array, data can be accessed by the associated index via the familiar Python square-bracket notation:

In [6]:
print(F[2])

14

In [7]:
print(F[2:5])

2    14
3    15
4    16
dtype: int64

From what we've seen so far, it may look like the Series object is basically interchangeable with a one-dimensional NumPy array. **The essential difference is the presence of the index**: while the Numpy Array has an implicitly defined integer index used to access the values, the Pandas Series has an explicitly defined index associated with the values.
This explicit index definition gives the Series object additional capabilities. For example, the index need not be an integer, but can consist of values of any desired type. For example, if we wish, we can use strings as an index:

In [8]:
seri = pd.Series([0.25, 0.5, 0.75, 1.0],index=['a', 'b', 'c', 'd'])
seri

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [9]:
seri['c']

0.75

In this way, you can think of a Pandas Series a bit like a specialization of a Python dictionary. A dictionary is a structure that maps arbitrary keys to a set of arbitrary values, and a Series is a structure which maps typed keys to a set of typed values. This typing is important: just as the type-specific compiled code behind a NumPy array makes it more efficient than a Python list for certain operations, the type information of a Pandas Series makes it much more efficient than Python dictionaries for certain operations.
The Series-as-dictionary analogy can be made even more clear by constructing a Series object directly from a Python dictionary:

In [10]:
population_dict = {'California': 38332521,
                   'Texas': 2644819,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas          2644819
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

Unlike a dictionary, though, the Series also supports array-style operations such as slicing:

In [11]:
population_dict.keys()

dict_keys(['California', 'Texas', 'New York', 'Florida', 'Illinois'])

In [12]:
population_dict['California':'New York']

TypeError: unhashable type: 'slice'

In [13]:
population['California':'New York']

California    38332521
Texas          2644819
New York      19651127
dtype: int64

In [14]:
population.keys

<bound method Series.keys of California    38332521
Texas          2644819
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64>

#### The `Pandas DataFrame` Object

The next fundamental structure in `Pandas`  is the `DataFrame` . Like the Series object discussed in the previous section, the DataFrame can be thought of either as a generalization of a NumPy array, or as a specialization of a Python dictionary. We'll now take a look at each of these perspectives.

If a Series is an analog of a one-dimensional array with flexible indices, a DataFrame is an analog of a two-dimensional array with both flexible row indices and flexible column names. Just as you might think of a two-dimensional array as an ordered sequence of aligned one-dimensional columns, you can think of a DataFrame as a sequence of aligned Series objects. Here, by "aligned" we mean that they share the same index.

In [15]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64


Now that we have this along with the population Series from before, we can use a dictionary to construct a single two-dimensional object containing this information:

In [16]:
states = pd.DataFrame({'population': population,
                       'area': area})
states

            population    area
California    38332521  423967
Texas          2644819  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

Like the Series object, the DataFrame has an index attribute that gives access to the index labels:

In [17]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

Additionally, the DataFrame has a columns attribute, which is an Index object holding the column labels:

In [18]:
states.columns

Index(['population', 'area'], dtype='object')


Thus the DataFrame can be thought of as a generalization of a two-dimensional NumPy array, where both the rows and columns have a generalized index for accessing the data.

#### The `Pandas Index` Object

We have seen here that both the Series and DataFrame objects contain an explicit index that lets you reference and modify data. This Index object is an interesting structure in itself, and it can be thought of either as an immutable array or as an ordered set (technically a multi-set, as Index objects may contain repeated values). Those views have some interesting consequences in the operations available on Index objects. As a simple example, let's construct an Index from a list of integers:

In [19]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Index([2, 3, 5, 7, 11], dtype='int64')

The Index in many ways operates like an array. For example, we can use standard Python indexing notation to retrieve values or slices:

In [20]:
ind[0]

2

In [21]:
ind[::2] # every second object starting at 0

Index([2, 5, 11], dtype='int64')

Index objects also have many of the attributes familiar from NumPy arrays:

In [22]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

One difference between Index objects and NumPy arrays is that indices are immutable–that is, they cannot be modified via the normal means

In [23]:
ind[1] = 0

TypeError: Index does not support mutable operations

### Data selection in `Pandas`

#### Data Selection in Series

As we saw in the previous section, a Series object acts in many ways like a one-dimensional NumPy array, and in many ways like a standard Python dictionary. If we keep these two overlapping analogies in mind, it will help us to understand the patterns of data indexing and selection in these arrays.

Like a dictionary, the Series object provides a mapping from a collection of keys (i.e. the index) to a collection of values:

In [24]:
seri

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [25]:
seri['d']

1.0

We can also use dictionary-like Python expressions and methods to examine the keys/indices and values:

In [26]:
seri.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [27]:
list(seri.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [28]:
'a' in seri

True

Series objects can even be modified with a dictionary-like syntax. Just as you can extend a dictionary by assigning to a new key, you can extend a Series by assigning to a new index value:

In [29]:
seri['e'] = 1.25
seri

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [30]:
seri['a'] = 0

In [31]:
seri

a    0.00
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

A Series builds on this dictionary-like interface and provides array-style item selection via the same basic mechanisms as NumPy arrays – that is, slices, masking, and fancy indexing. Examples of these are as follows:

In [32]:
# slicing by explicit index
seri['a':'c']

a    0.00
b    0.50
c    0.75
dtype: float64

In [33]:
# slicing by implicit integer index
seri[0:2]

a    0.0
b    0.5
dtype: float64

In [34]:
seri[seri>=0.5]

b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [35]:
# masking

seri[(seri > 0.3) & (seri < 0.8)]

b    0.50
c    0.75
dtype: float64

In [36]:
# multiple indexing
seri[['a', 'e', "c"]]

a    0.00
e    1.25
c    0.75
dtype: float64

Among these, slicing may be the source of the most confusion. Notice that when slicing with an explicit index (i.e., data['a':'c']), the final index is included in the slice, while when slicing with an implicit index (i.e., data[0:2]), the final index is excluded from the slice.

**Indexers: loc and iloc**

These slicing and indexing conventions can be a source of confusion. For example, if your Series has an explicit integer index, an indexing operation such as data[1] will use the explicit indices, while a slicing operation like data[1:3] will use the implicit Python-style index.

In [37]:
data = pd.Series(['a', 'b', 'c', 'd'], index=[1, 3, 5,7])
data

1    a
3    b
5    c
7    d
dtype: object

In [38]:
# explicit index when indexing
data[5]

'c'

In [39]:
# implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

Because of this potential confusion in the case of integer indexes, Pandas provides some special indexer attributes that explicitly expose certain indexing schemes. These are not functional methods, but attributes that expose a particular slicing interface to the data in the Series.
First, the `.loc` attribute allows indexing and slicing that always references the **explicit index**:

In [40]:
data.loc[1]

'a'

In [41]:
data.loc[1:3]

1    a
3    b
dtype: object

The `.iloc` attribute allows indexing and slicing that always references the **implicit Python-style index**:

In [42]:
data.iloc[1]

'b'

In [43]:
data.iloc[1:3]

3    b
5    c
dtype: object

One guiding principle of Python code is that **"explicit is better than implicit"**. The explicit nature of `.loc` and `.iloc` make them very useful in maintaining clean and readable code; especially in the case of integer indexes, I recommend using these both to make code easier to read and understand, and to prevent subtle bugs due to the mixed indexing/slicing convention.

#### Data Selection in DataFrame

Recall that a DataFrame acts in many ways like a two-dimensional or structured array, and in other ways like a dictionary of Series structures sharing the same index. These analogies can be helpful to keep in mind as we explore data selection within this structure.

In [44]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

The individual Series that make up the columns of the DataFrame can be accessed via dictionary-style indexing of the column name:

In [45]:
data['pop']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
Name: pop, dtype: int64

As mentioned previously, we can also view the DataFrame as an enhanced two-dimensional array. We can examine the raw underlying data array using the values attribute:

In [46]:
data.values

array([[  423967, 38332521],
       [  695662, 26448193],
       [  141297, 19651127],
       [  170312, 19552860],
       [  149995, 12882135]])

With this picture in mind, many familiar array-like observations can be done on the DataFrame itself. For example, we can transpose the full DataFrame to swap rows and columns:

In [47]:
data.T

      California     Texas  New York   Florida  Illinois
area      423967    695662    141297    170312    149995
pop     38332521  26448193  19651127  19552860  12882135

When it comes to indexing of DataFrame objects, however, it is clear that the dictionary-style indexing of columns precludes our ability to simply treat it as a NumPy array. In particular, passing a single index to an array accesses a row:

In [48]:
data.values[0]

array([  423967, 38332521])

and passing a single "index" to a DataFrame accesses a column:

In [49]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

Thus for array-style indexing, we need another convention. Here Pandas again uses the `.loc` and `.iloc` indexers mentioned earlier. Using the `.iloc` indexer, we can index the underlying array as if it is a simple NumPy array (using the implicit Python-style index), but the DataFrame index and column labels are maintained in the result:

In [50]:
data.iloc[:3, :]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

Similarly, using the `.loc` indexer we can index the underlying data in an array-like style but using the explicit index and column names:

In [51]:
data.loc[:'Texas', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193

We can also pass conditions to the indexer, a technique calles **masking**.

In [52]:
# masking with .loc

data.loc[data.area > 200000]

              area       pop
California  423967  38332521
Texas       695662  26448193

In [53]:
# masking with explicit column index

new_df = data[data["area"] > 200000]

In [54]:
new_df

              area       pop
California  423967  38332521
Texas       695662  26448193

Masks are conditional statements that are evaluated for every element (i.e., row) of the DataFrame.
If you want to combine multiple statements, you can use boolean operators: `&`, `|`. Negation is handled with `~` in pandas masking. Be aware that you cannot use operators such as `and`, `or`, `!`, `not`.

In [55]:
data[(data["area"] > 100000) & (data["area"] <= 180000)]

            area       pop
New York  141297  19651127
Florida   170312  19552860
Illinois  149995  12882135

**Exercise**: Produce a DF of states with population >15M and <30M or area >100K and <200K. Name this DF `mid_sized_states_df`.

In [56]:
# Your code here

Any of these indexing conventions may also be used to set or modify values; this is done in the standard way that you might be accustomed to from working with NumPy:

In [57]:
data.iloc[0, 1] = 90000000
data

              area       pop
California  423967  90000000
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

**Exercise**: Set the population of New York to 20M

In [58]:
# Your code here

### Data anaylsis and manipulation in `Pandas`

#### Hierarchical Indexing

**Using MultiIndex to create hierarchichal DataFrames**

Often it is useful to store higher-dimensional data, i.e. data indexed by more than one or two keys. The most approapriate Pandas function for this is `MultiIndex`. We will demonstrate using a simple example:

In [59]:
# We use 2-D example, first specifying the outer and inner dimension as well as the values
Outer = ['California','California',
         'New York','New York',
         'Texas','Texas']

Inner = [2000,2010,
         2000,2010,
         2000,2010]

populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]

# From the outer and inner dimensions we create an index

index_list = list(zip(Outer,Inner))
index_list

[('California', 2000),
 ('California', 2010),
 ('New York', 2000),
 ('New York', 2010),
 ('Texas', 2000),
 ('Texas', 2010)]

In [60]:
# From this index a multi index can be created
index_object = pd.MultiIndex.from_tuples(index_list)
index_object

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

You can generate the same result using the `MultiIndex.from_arrays()` function fro **Pandas**. Keep in mind the size of arrays has to be the same.

In [61]:
mul_ind = pd.MultiIndex.from_arrays([Outer, Inner])
mul_ind

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [62]:
# Finally we create a data frame with hierarchichal indexes

df = pd.DataFrame(index=index_object,
                  data=populations,
                  columns=["Population"])

df

                 Population
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [63]:
area = [164,164, #California 
        55,55,   #NY State
        269,269] #Texas

df["Area"] = area

df

                 Population  Area
California 2000    33871648   164
           2010    37253956   164
New York   2000    18976457    55
           2010    19378102    55
Texas      2000    20851820   269
           2010    25145561   269

In [64]:
# We can traspose this DataFrame
df.transpose()

           California            New York               Texas
                 2000      2010      2000      2010      2000      2010
Population   33871648  37253956  18976457  19378102  20851820  25145561
Area              164       164        55        55       269       269

**MultiIndex as extra dimension**

You might notice that we could have stored the same data using a simple DataFrame with index and column labels. The `unstack()` method allows us to convert a hierachically indexed Series into a conventionally indexed DataFrame

In [65]:
df.unstack()["Population"]

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

Pivot a level of the (necessarily hierarchical) index labels, returning
a DataFrame having a new level of column labels whose inner-most level
consists of the pivoted index labels

In [66]:
df.unstack(level = -1)

           Population           Area
                 2000      2010 2000 2010
California   33871648  37253956  164  164
New York     18976457  19378102   55   55
Texas        20851820  25145561  269  269

In [67]:
df.pivot(columns = 'Area')

                 Population
Area                    55          164         269
California 2000         NaN  33871648.0         NaN
           2010         NaN  37253956.0         NaN
New York   2000  18976457.0         NaN         NaN
           2010  19378102.0         NaN         NaN
Texas      2000         NaN         NaN  20851820.0
           2010         NaN         NaN  25145561.0

#### Merging data in `Pandas`

Pandas also makes it easy to combine Series and DataFrame. Multiple Series can be joined to represent a DataFrame, while multiple DataFrame can be joined in a table style join (like in databases):

In [68]:
s1 = pd.Series([1,1,2,2,3,3], name = 'Series 1')
s2 = pd.Series([1.1, 1.2, 2.2, 2.4, 3.3, 3.6], name = 'Series 2')
 
pd.DataFrame([s1, s2])

            0    1    2    3    4    5
Series 1  1.0  1.0  2.0  2.0  3.0  3.0
Series 2  1.1  1.2  2.2  2.4  3.3  3.6

In [69]:
s1

0    1
1    1
2    2
3    2
4    3
5    3
Name: Series 1, dtype: int64

If we want them to represent columns, we need to supply them as values of a dictionary indexed by column names:

In [70]:
s1s2 = pd.DataFrame({'Series 1': s1, 'Series 2': s2})
s1s2

   Series 1  Series 2
0         1       1.1
1         1       1.2
2         2       2.2
3         2       2.4
4         3       3.3
5         3       3.6

In [71]:
s1sq = pd.DataFrame({'Series 1 squared': s1**2})

In [72]:
s1sq

   Series 1 squared
0                 1
1                 1
2                 4
3                 4
4                 9
5                 9

In [73]:
pd.merge(s1s2, s1sq, left_index=True, right_index=True)

   Series 1  Series 2  Series 1 squared
0         1       1.1                 1
1         1       1.2                 1
2         2       2.2                 4
3         2       2.4                 4
4         3       3.3                 9
5         3       3.6                 9

Here, we join on the index, but we could also join on another column:

In [74]:
a = pd.DataFrame({
    'key': [1,2,4,5,5,6],
    'value': [0.1, 0.2, 0.4, 0.5, 0.55, 0.6]
})

b = pd.DataFrame({
    'key': [1,2,4,5,5,6],
    'value': pd.Series([0.1, 0.2, 0.4, 0.5, 0.55, 0.6]) ** 2
})

pd.merge(a, b, on = 'key')

   key  value_x  value_y
0    1     0.10   0.0100
1    2     0.20   0.0400
2    4     0.40   0.1600
3    5     0.50   0.2500
4    5     0.50   0.3025
5    5     0.55   0.2500
6    5     0.55   0.3025
7    6     0.60   0.3600

Observe that there are more rows that in each of the individual DataFrames. This is because, we do an inner style join, where we return every match, and the key `5` matches four times, as it is present two times in both DataFrames!

#### Quick data analysis in `Pandas`

In practice your dataset will often be considerably larger than the illustrative example above. In these cases it is often useful to run brief descriptive statistical analyses on the set, which will help to get a first feel for the data. 

We will demonstrate how to do this using the provided `iris.csv` dataset. This is a famous dataset used frequently for educational purposes in data science. You can read up on the dataset, its content and its origins here: https://en.wikipedia.org/wiki/Iris_flower_data_set.

The iris dataset contains measurements for 150 iris flowers from three different species.

The __three classes__ in the Iris dataset:
* Iris-setosa (n=50)
* Iris-versicolor (n=50)
* Iris-virginica (n=50)

The __four features__ of the Iris dataset:
* sepal length in cm
* sepal width in cm
* petal length in cm
* petal width in cm

<img src="./iris.original.png" width="600" height="400"/>

In [75]:
# first read in the data as a dataframe
# for the indirect reference "iris.csv" to work make sure it is contained in the same folder as your notebook
# You can set the index by using the index_col function

Iris_set = pd.read_csv("iris.csv", index_col="number")

In [76]:
Iris_set.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [77]:
Iris_set.head()

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
number
1                5.1          3.5           1.4          0.2  setosa
2                4.9          3.0           1.4          0.2  setosa
3                4.7          3.2           1.3          0.2  setosa
4                4.6          3.1           1.5          0.2  setosa
5                5.0          3.6           1.4          0.2  setosa

In [78]:
Iris_set.tail(1)

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
number
150              5.9          3.0           5.1          1.8  virginica

In [79]:
# the describe function provides an overviewof key descriptive statistics

Iris_set.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    146.000000   148.000000    147.000000   149.000000
mean       5.832877     3.059459      3.734694     1.191946
std        0.819345     0.435943      1.775196     0.759402
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.550000     0.300000
50%        5.800000     3.000000      4.300000     1.300000
75%        6.400000     3.325000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [80]:
Iris_set.info()

<class 'pandas.core.frame.DataFrame'>
Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  146 non-null    float64
 1   Sepal.Width   148 non-null    float64
 2   Petal.Length  147 non-null    float64
 3   Petal.Width   149 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [81]:
# you can also focus your analysis on individual features by indexing them

Iris_set["Sepal.Width"].describe()

count    148.000000
mean       3.059459
std        0.435943
min        2.000000
25%        2.800000
50%        3.000000
75%        3.325000
max        4.400000
Name: Sepal.Width, dtype: float64

In [82]:
# additionally you can call the functions seperately, e.g. max

Iris_set.max()

Sepal.Length          7.9
Sepal.Width           4.4
Petal.Length          6.9
Petal.Width           2.5
Species         virginica
dtype: object

#### Handling missing numerical data (`NaN` values)
If you have paid attention to the descriptive statistics above you will have noticed that some the __count__ of values differs across features. This is a first indication for missing numerical data. In the real world you will often encounter incomplete and noisy data which will require pre-processing before you can apply data science and machine learning tools to them. In this section we will provide a quick overview on how to deal with missing data in your data sets. 
Note that there are multiple ways how Python, pandas, and other packages might highlight missing data:
* `NaN` - (acronym for Not a Number), is a special floating-point value recognized by all systems that use the standard IEEE floating-point representation. pandas uses this for display
* `pd.NA` - is a special pandas type, that is shorthand for all other types
* `None` - Python-specific object that is often used for missing data in Python code. Because it is a Python object, `None` can only be used in arrays with data type 'object' (i.e., arrays of Python objects)

**Detecting missing numerical data**

Pandas data structures have two useful methods for detecting null data: `isnull()` and `notnull()`. Either one will return a Boolean mask over the data.

In [83]:
# isnull() returns "True" for every missing numerical value in the dataset
Iris_set.isnull()

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width  Species
number
1              False        False         False        False    False
2              False        False         False        False    False
3              False        False         False        False    False
4              False        False         False        False    False
5              False        False         False        False    False
...              ...          ...           ...          ...      ...
146            False        False         False        False    False
147            False        False         False        False    False
148            False        False         False        False    False
149            False        False         False        False    False
150            False        False         False        False    False

[150 rows x 5 columns]

In [84]:
# notnull() returns "False" for every missing numerical value in the dataset

Iris_set.notnull()

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width  Species
number
1               True         True          True         True     True
2               True         True          True         True     True
3               True         True          True         True     True
4               True         True          True         True     True
5               True         True          True         True     True
...              ...          ...           ...          ...      ...
146             True         True          True         True     True
147             True         True          True         True     True
148             True         True          True         True     True
149             True         True          True         True     True
150             True         True          True         True     True

[150 rows x 5 columns]

#### Dealing with missing numerical data
In essence two approaches to dealing with missing data exist:
* __Elimination__: Dropping null values from the dataset
* __Imputation__: Imputing/replacing null values with numerical values/estimates

**Elimination (i.e. dropping null values)**

We cannot drop single values from a data frame; we can only drop full rows or full columns. Depending on the application, you might want one or the other, so `dropna()` gives a number of options:

We use the `dropna(axis=0)` function to drop all rows from the dataset that incl. null values. Note that `dropna()` will not modify your dataframe unless you call `dropna(axis=0,inplace=True)`

In [85]:
Iris_set.dropna(axis=0, inplace=False)

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
number
1                5.1          3.5           1.4          0.2     setosa
2                4.9          3.0           1.4          0.2     setosa
3                4.7          3.2           1.3          0.2     setosa
4                4.6          3.1           1.5          0.2     setosa
5                5.0          3.6           1.4          0.2     setosa
...              ...          ...           ...          ...        ...
146              6.7          3.0           5.2          2.3  virginica
147              6.3          2.5           5.0          1.9  virginica
148              6.5          3.0           5.2          2.0  virginica
149              6.2          3.4           5.4          2.3  virginica
150              5.9          3.0           5.1          1.8  virginica

[140 rows x 5 columns]

In [86]:
Iris_set

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
number
1                5.1          3.5           1.4          0.2     setosa
2                4.9          3.0           1.4          0.2     setosa
3                4.7          3.2           1.3          0.2     setosa
4                4.6          3.1           1.5          0.2     setosa
5                5.0          3.6           1.4          0.2     setosa
...              ...          ...           ...          ...        ...
146              6.7          3.0           5.2          2.3  virginica
147              6.3          2.5           5.0          1.9  virginica
148              6.5          3.0           5.2          2.0  virginica
149              6.2          3.4           5.4          2.3  virginica
150              5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

We use the `dropna(axis=1)` function to drop all columns from the dataset that incl. null values. Note that, also in this case, `dropna()` will not modify your dataframe unless you call `dropna(axis=1,inplac=True)`

In [87]:
Iris_set.dropna(axis=1)

          Species
number
1          setosa
2          setosa
3          setosa
4          setosa
5          setosa
...           ...
146     virginica
147     virginica
148     virginica
149     virginica
150     virginica

[150 rows x 1 columns]

In [88]:
# As can be seen below dropna() does not modify the original dataframe!

len(Iris_set)

150

In [89]:
# We can therefore also use dropna() to easily identify the number of rows with missing values 

len(Iris_set)-len(Iris_set.dropna())

10

In [90]:
# If you whish to clean the data with dropna it is good practice to define a new data frame

Iris_set_clean = Iris_set.dropna(axis=0)

In [91]:
len(Iris_set_clean)

140

**Exercise**: Use the technique of **masking** to display all records with NaN values for Sepal.Length.

In [92]:
# Your code here

**Imputation (i.e. filling null values)**

Imputation fills null values with numerical values chosen by the data scientist. For this `fillna()`provides the appropriate tools.

The data scientist will usually choose one of the following methods:
* Fill with zeros: `fillna(0)`
* Conduct a forward fill (i.e. filling NaN values with data from following observation): `fillna(method="ffill")`
* Conduct a backward fill (i.e. filling NaN values with data from previous observation): `fillna(method="bfill")`
* Fill with the column mean,max,min, etc.: `df["Col_name"].fillna(value=df["Col_name"].mean())`
* Custom fill depending on the application

In [93]:
# fillna() allows for inserting a number of choice, confirm with inplace=True

Iris_set[["Sepal.Length"]].fillna(value=Iris_set["Sepal.Length"].mean())

        Sepal.Length
number
1                5.1
2                4.9
3                4.7
4                4.6
5                5.0
...              ...
146              6.7
147              6.3
148              6.5
149              6.2
150              5.9

[150 rows x 1 columns]

#### Data aggregation and grouping
The `groupby()` method allows for grouping of rows and the application of aggregation functions to these grouped rows. It is a highly useful method in data science and unsed extensively. We will return to the iris dataset for illustration purposes.

In [94]:
Iris_set.groupby("Species")

In [95]:
# We might want to group rows according to "Species" and assign to a new variable "Species_group"

Species_groups = Iris_set.groupby("Species").describe()

In [96]:
# This now allows us to perform a whole range of aggregation methods on the groups, e.g.:

Species_groups

           Sepal.Length                                                \
                  count      mean       std  min   25%  50%  75%  max
Species
setosa             49.0  5.010204  0.354874  4.3  4.80  5.0  5.2  5.8
versicolor         50.0  5.936000  0.516171  4.9  5.60  5.9  6.3  7.0
virginica          47.0  6.580851  0.629920  4.9  6.25  6.5  6.9  7.9

           Sepal.Width            ... Petal.Length      Petal.Width            \
                 count      mean  ...          75%  max       count      mean
Species                           ...
setosa            49.0  3.430612  ...        1.575  1.9        50.0  0.246000
versicolor        50.0  2.770000  ...        4.600  5.1        50.0  1.326000
virginica         49.0  2.983673  ...        5.900  6.9        49.0  2.020408


                 std  min  25%  50%  75%  max
Species
setosa      0.105386  0.1  0.2  0.2  0.3  0.6
versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
virginica   0.274605  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]

In [97]:
# or select an individual group across all features. Note that you need to transpose the array before you can index the group.

Iris_set.groupby("Species").describe().transpose()[["versicolor"]]

Species             versicolor
Sepal.Length count   50.000000
             mean     5.936000
             std      0.516171
             min      4.900000
             25%      5.600000
             50%      5.900000
             75%      6.300000
             max      7.000000
Sepal.Width  count   50.000000
             mean     2.770000
             std      0.313798
             min      2.000000
             25%      2.525000
             50%      2.800000
             75%      3.000000
             max      3.400000
Petal.Length count   49.000000
             mean     4.255102
             std      0.473489
             min      3.000000
             25%      4.000000
             50%      4.300000
             75%      4.600000
             max      5.100000
Petal.Width  count   50.000000
             mean     1.326000
             std      0.197753
             min      1.000000
             25%      1.200000
             50%      1.300000
             75%      1.500000
             max      1.800000

You can also apply aggregation functions to each group using groupby-apply syntax:

In [98]:
Iris_set.groupby("Species").max()

            Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
Species
setosa               5.8          4.4           1.9          0.6
versicolor           7.0          3.4           5.1          1.8
virginica            7.9          3.8           6.9          2.5

Here, we applied the `max` aggregation function to all groups, but we can restrict that to columns and even use different aggregation functions per column of interest using the more flexible `agg` functionality. We need to give the desired aggregation function for every column, and columns we don't explicitly list get omitted in aggregation:

In [99]:
Iris_set.groupby("Species").agg({'Sepal.Length': min, 'Sepal.Width': 'max', 'Petal.Length': np.median})

/var/folders/tm/rzk5w14x43s6q7sgpkq2r7wc0000gn/T/ipykernel_2504/4152635175.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  Iris_set.groupby("Species").agg({'Sepal.Length': min, 'Sepal.Width': 'max', 'Petal.Length': np.median})
/var/folders/tm/rzk5w14x43s6q7sgpkq2r7wc0000gn/T/ipykernel_2504/4152635175.py:1: FutureWarning: The provided callable <function median at 0x1041fcca0> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  Iris_set.groupby("Species").agg({'Sepal.Length': min, 'Sepal.Width': 'max', 'Petal.Length': np.median})

            Sepal.Length  Sepal.Width  Petal.Length
Species
setosa               4.3          4.4           1.5
versicolor           4.9          3.4           4.3
virginica            4.9          3.8           5.6

We see that there are multiple possibilities to tell pandas which aggregation function it should use, but it warns us that it only infered the correct function from two of the options, which is why we should provide the aggregation function as a string to `agg`.
You can see which functions are available by looking at the documentation, but mostly these are numpy functions that work on arrays: [Documentation](https://pandas.pydata.org/docs/user_guide/groupby.html#built-in-aggregation-methods).

Sometimes you might wish to give the resulting columns names that reflect what aggregation you used. You can use named aggregation for that, but must then use keyword arguments instead of passing a dictionary:

In [100]:
df = pd.DataFrame({
    'group': ['A', 'A', 'B', 'C', 'C', 'C'],
    'somevalue': [1, 2, 1.5, 1, 2, 3],
    'anothervalue': [1.1, 2.1, 1.6, 1.1, 2.1, 3.1]
})

In [101]:
df.groupby('group').agg(
    somevalue_avg = pd.NamedAgg(column='somevalue', aggfunc='mean'), 
    anothervalue_max = pd.NamedAgg(column='anothervalue', aggfunc='max'),     
)

       somevalue_avg  anothervalue_max
group
A                1.5               2.1
B                1.5               1.6
C                2.0               3.1

Unluckily, this only works if the new column names are valid Python keywords, which would for example not be the case when we want to name resulting columns in our flower example using the syntax `agg.columnname`.

In [102]:
Iris_set.groupby("Species").agg(
    avg.Sepal.Length = pd.NamedAgg(column='Sepal.Length', aggfunc='mean'),
    median.Sepal.Length = pd.NamedAgg(column='Sepal.Length', aggfunc='median')
)

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (846406621.py, line 2)

Here, we need a little trick (which is presented in the pandas documentation: [here](https://pandas.pydata.org/docs/user_guide/groupby.html#named-aggregation)): Python functions accept a dynamic unpacking of dictionaries for keywords arguments (`**kwargs`), which is why we can circumvent the illegal named aggregation:

In [103]:
Iris_set.groupby("Species").agg(
    **{
    'avg.Sepal.Length': pd.NamedAgg(column='Sepal.Length', aggfunc='mean'),
    'median.Sepal.Length': pd.NamedAgg(column='Sepal.Length', aggfunc='median')
    }
)

            avg.Sepal.Length  median.Sepal.Length
Species
setosa              5.010204                  5.0
versicolor          5.936000                  5.9
virginica           6.580851                  6.5

---

**Final Exercise:** Combine all of your gained knowledge on how to wrangle data with the pandas library to create a summary DataFrame of the Iris dataset that contains the following columns per species: Number of missing values, Mean, Mean with missing values imputed with zero.

> Hint: There are multiple ways to achieve the same outcome, find the one working best for you, and then probably iterate on that and try to find one that is faster (less steps).

In [104]:
iris = pd.read_csv('iris.csv')
# YOUR CODE HERE

Lastly, I would like to introduce you a package that can be a shortcut for some analysis of your data: [sidetable](https://github.com/chris1610/sidetable).

In [105]:
!pip install sidetable
import sidetable
iris.stb.missing() # when importing sidetable, it enables a "stb" accessor attribute automatically for DataFrame's

Requirement already satisfied: sidetable in /Users/janik/miniconda3/envs/AA/lib/python3.10/site-packages (0.9.1)
Requirement already satisfied: pandas>=1.0 in /Users/janik/miniconda3/envs/AA/lib/python3.10/site-packages (from sidetable) (2.1.1)
Requirement already satisfied: numpy>=1.22.4 in /Users/janik/miniconda3/envs/AA/lib/python3.10/site-packages (from pandas>=1.0->sidetable) (1.26.0)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/janik/miniconda3/envs/AA/lib/python3.10/site-packages (from pandas>=1.0->sidetable) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/janik/miniconda3/envs/AA/lib/python3.10/site-packages (from pandas>=1.0->sidetable) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /Users/janik/miniconda3/envs/AA/lib/python3.10/site-packages (from pandas>=1.0->sidetable) (2023.3)
Requirement already satisfied: six>=1.5 in /Users/janik/miniconda3/envs/AA/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas>=1.0->sidetable) (1.16.0)

              missing  total   percent
Sepal.Length        4    150  2.666667
Petal.Length        3    150  2.000000
Sepal.Width         2    150  1.333333
Petal.Width         1    150  0.666667
number              0    150  0.000000
Species             0    150  0.000000

With one simple import and function call, we were able to quickly pinpoint potential data issues from missing data! This is the power of open source software. There are basically Python packages for everything out there, but you need to be sure that the cost-benefit trade-off of installing an additional package against quickly coding some functionality yourself works out for your project.

> Remember to include all packages that you use in your team assignment in an environment specification file!

> Some packages, like sidetable, are not available through conda, so we need to use the python packaging index PyPI and it's package installer `pip` which ships with Python. This is however, danger territory, as it is not advised to mix conda and pip packages whenever possible, because it will be harder for the conda dependency solver to update packages automatically with dependencies from pip.
> However, if you do so, please follow the example syntax in this projects `environment.yml` specification to install pip packages on top your conda environment.

This brings us to the end of `Workshop_03`. Next week we will cover visualization techniques using `Matplotlib`.

---